/**
****************************************************************************************
* @FilePath: item_54.cpp
* @Author: Modest Wang 1598593280@qq.com
* @Date: 2024-01-31 19:02:40
* @LastEditors: Modest Wang
* @LastEditTime: 2024-01-31 19:02:40
* @2024 by Modest Wang, All Rights Reserved.
* @Descripttion: 让自己熟悉包括TR1在内的标准程序库
****************************************************************************************
*/

// TR1是C++标准委员会的一个技术报告，它包含了一些新的C++标准库组件，这些组件将在C++0x标准中被采纳。
// TR1(即Technical Report 1)

// C++11标准中，已经包含了TR1中的内容，所以在C++11中，TR1中的内容不再是TR1，而是C++11标准的一部分。
